A modeling error occurred: this happens when a modifier failed to subtract from main body
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId FabricationShapeModelingError { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationShapeModelingError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationShapeModelingError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FabricationShapeFailures Class
  Autodesk.Revit.DB Namespace